niwciu/MODBUS/examples/modbus driver templates/STM32G070R/modbus_master_driver_config_usart4.h
/**
 * @file modbus_master_driver_config_usart4.h
 * @author niwciu (niwciu@gmail.com)
 * @brief Header file with defines that speed up modbus master driver configuration
 *        specially when porting driver to different USARTs and Timers.
 *        STM32G070R — USART4 variant.
 *        USART4: PA0=TX (AF4), PA1=RX (AF4), PB3=DE (AF4)
 *        TIM7: APB1
 *        DMA1_Channel4 via DMAMUX1_Channel3, USART4_TX resource=57
 *        NOTE: USART3 and USART4 share IRQ (USART3_4_IRQHandler).
 *        NOTE: DMA1_Channel4 IRQ is shared (DMA1_Ch4_7_DMAMUX1_OVR_IRQHandler).

 * @version 0.0.1
 * @date 2025-08-31
 *
 * @copyright Copyright (c) 2025
 *
 */
#pragma once

#include "stm32g070xx.h"

#define OFF 0
#define ON 1
#define LOW 0
#define HIGH 1

#define MASTER_USE_DMA ON
#define MASTER_USART_DE_HW_CONTROLL ON

/** modbus USART configuration*/
#define MODBUS_MASTER_USART (USART4)
#define MODBUS_MASTER_USART_CLK APBENR1
#define MODBUS_MASTER_USART_CLK_EN (RCC_APBENR1_USART4EN)
#define MODBUS_MASTER_USART_CLK_FREQ 64000000UL
#define MODBUS_MASTER_USART_IRQN USART3_4_IRQn
#define MODBUS_MASTER_USART_IRQHandler USART3_4_IRQHandler
#define MODBUS_MASTER_USART_IRQ_PRIORITY 10

#if MASTER_USE_DMA == ON
#define MODBUS_MASTER_DMA DMA1
#define MODBUS_MASTER_DMA_IRQN DMA1_Ch4_7_DMAMUX1_OVR_IRQn
#define MODBUS_MASTER_DMA_IRQHandler DMA1_Ch4_7_DMAMUX1_OVR_IRQHandler
#define MODBUS_MASTER_DMA_chanel DMA1_Channel4
#define MODBUS_MASTER_DMA_ISR_TCIF DMA_ISR_TCIF4
#define MODBUS_MASTER_DMA_ISR_TEIF DMA_ISR_TEIF4

#define USART1_TX_RESOURCE 51
#define USART2_TX_RESOURCE 53
#define USART3_TX_RESOURCE 55
#define USART4_TX_RESOURCE 57
#define MODBUS_MASTER_USART_TX_RESOURCE USART4_TX_RESOURCE

#define MODBUS_MASTER_DMAMUX_Chanel (DMAMUX1_Channel3)
#endif

/** GPIO ports — PA0/PA1 on GPIOA, PB3 (DE) on GPIOB */
#define MODBUS_MASTER_USART_RX_TX_PORT (GPIOA)
#define MODBUS_MASTER_USART_DE_PORT (GPIOB)


#define MODBUS_MASTER_USART_RX_MODE (GPIO_MODER_MODE1_1) // af mode
#define MODBUS_MASTER_USART_TX_MODE (GPIO_MODER_MODE0_1) // af mode
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_MODE (GPIO_MODER_MODE3_1) // af mode
#else
#define MODBUS_MASTER_USART_DE_MODE (GPIO_MODER_MODE3_0) // general purpose output mode
#endif

#define MODBUS_MASTER_USART_RX_MODE_Msk (GPIO_MODER_MODE1)
#define MODBUS_MASTER_USART_TX_MODE_Msk (GPIO_MODER_MODE0)
#define MODBUS_MASTER_USART_DE_MODE_Msk (GPIO_MODER_MODE3)

/** AF register masks — PA0/PA1 in AFRL, PB3 (DE) in AFRL */
#define MODBUS_MASTER_USART_RX_AF_Msk (GPIO_AFRL_AFSEL1)
#define MODBUS_MASTER_USART_TX_AF_Msk (GPIO_AFRL_AFSEL0)
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_AF_Msk (GPIO_AFRL_AFSEL3)
#endif

/** AF4 values for USART4 on PA0/PA1/PB3 */
#define MODBUS_MASTER_USART_RX_AF (GPIO_AFRL_AFSEL1_2)
#define MODBUS_MASTER_USART_TX_AF (GPIO_AFRL_AFSEL0_2)
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_AF (GPIO_AFRL_AFSEL3_2)
#endif

/** PA0/PA1 in AFRL, PB3 (DE) in AFRL */
#define MODBUS_MASTER_USART_RX_TX_AF_REG (LOW)
#if MASTER_USART_DE_HW_CONTROLL == ON
#define MODBUS_MASTER_USART_DE_AF_REG (LOW)
#endif

// additionaly defines for manual DE controll
#if MASTER_USART_DE_HW_CONTROLL == OFF
#define MODBUS_MASTER_USART_DE_PUPDR        GPIO_PUPDR_PUPD3_0
#define MODBUS_MASTER_USART_DE_PUPDR_Msk    GPIO_PUPDR_PUPD3_Msk

#define MODBUS_MASTER_USART_DE_RESET_PIN	GPIO_BSRR_BR3
#define MODBUS_MASTER_USART_DE_SET_PIN		GPIO_BSRR_BS3
#endif

//#define MODBUS_MASTER_USART_GPIO_CLK_EN (RCC_IOPENR_GPIOAEN)
#define MODBUS_MASTER_USART_GPIO_RX_TX_CLK_EN (RCC_IOPENR_GPIOAEN)
#define MODBUS_MASTER_USART_GPIO_DE_CLK_EN (RCC_IOPENR_GPIOBEN)


/** modbus Timer configuration*/
#define MODBUS_MASTER_TIMER (TIM7)
#define MODBUS_MASTER_TIMER_APBENR (RCC->APBENR1)
#define MODBUS_MASTER_TIMER_CLK_EN (RCC_APBENR1_TIM7EN)
#define MODBUS_MASTER_TIMER_CLK_FREQ 64000000UL
#define MODBUS_MASTER_TIMER_IRQN TIM7_IRQn
#define MODBUS_MASTER_TIMER_IRQHandler TIM7_IRQHandler
#define MODBUS_MASTER_TIMER_IRQ_PRIORITY 10
